export const TOAST_MESSAGE = {
  SUCCESS: {
    ADD_MAILING: '메일링 서비스 구독을 완료하였습니다.',
    DELETE_MAILING: '메일링 서비스 구독을 취소하였습니다.',
    ADD_CALENDAR: '일정을 내 캘린더에 추가하였습니다.',
    DELETE_CALENDAR: '일정을 내 캘린더에서 삭제하였습니다.',
    CHANGE_NICKNAME: '사용자 이름을 변경하였습니다.',
    CHANGE_EMAIL: '사용자 이메일을 변경하였습니다. 새로운 이메일로 메일링 서비스를 해드릴게요!',
    CHANGE_INTEREST: '관심 분야가 수정되었습니다. 새로운 관심 분야로 자격증을 추천해 드려요!',
    DELETE_USER: '계정 탈퇴를 성공하였습니다.',
  },
  ERROR: {
    LOGIN: '일시적인 오류로 인해 로그인을 실패하였습니다. 잠시 후 다시 로그인해 주세요.',
    REFRESH: '세션이 만료되었습니다. 다시 로그인 해주세요.',
    LOGOUT: '일시적인 오류로 인해 로그아웃을 실패하였습니다. 잠시 후 다시 로그아웃해 주세요.',
    ADD_MAILING:
      '일시적인 오류로 인해 메일링 서비스 구독을 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    DELETE_MAILING:
      '일시적인 오류로 인해 메일링 서비스 구독을 취소하였습니다. 잠시 후 다시 시도해 주세요.',
    ADD_CALENDAR:
      '일시적인 오류로 인해 내 캘린더 추가를 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    DELETE_CALENDAR:
      '일시적인 오류로 인해 내 캘린더 삭제를 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    CHANGE_NICKNAME:
      '일시적인 오류로 인해 사용자 이름 변경에 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    CHANGE_EMAIL:
      '일시적인 오류로 인해 사용자 이메일을 변경에 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    CHANGE_MAILING:
      '일시적인 오류로 인해 메일링 서비스 활성화/비활성화를 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    CHANGE_INTEREST:
      '일시적인 오류로 인해 관심 분야 수정을 실패하였습니다. 잠시 후 다시 시도해 주세요.',
    DELETE_USER: '일시적인 오류로 인해 계정 탈퇴를 실패하였습니다. 잠시 후 다시 시도해 주세요.',
  },
};
